[{"id":"_ou0n74g9d","title":"GDX18V-1860CB15","description":" The Bosch GDX18V-1860C Two-in-One 1/4 In. and 1/2 In. Bit/Socket Impact Driver/Wrench is for use with bits and sockets. This two-in-one goes from impact wrench to impact driver fast, letting you do two jobs with one tool. Bits can stay conveniently inserted when using deep sockets, and more torque is transferred directly thru the 1/2 In. square drive anvil. There is no more torque loss through socket adapters or broken socket adapters. The impact driver/wrench's efficient, powerful brushless motor produces up to 1,860 In.-Lbs. of torque and 0-4,100 impacts per minute. In addition to three speed/torque settings this impact driver/wrench also features special modes to prevent work piece and fastener damage. The presets include modes for self-drilling metal screws and wood screws. Additional modes and customizations for specific screws and materials can be set and saved to the tool via the Bosch Toolbox App (connectivity module sold separately). In reverse, with bolt mode activated, the Auto Bolt Release stops rotation when there is no load on the tool to prevent accidentally dropping bolts and nuts during removal. In addition to customizing settings and modes, connectivity (module sold separately), provides tool specific information and feedback. The variable-speed trigger provides accurate driving speed. It also has an LED light system to illuminate the work area. The kit features a CORE18V® 4.0 Ah Compact Battery, allowing you to keep the power and lose the weight.","price":"999"},{"id":"_7e4f78aip","title":"GWX18V-8N","description":" The Bosch GWX18V-8 is an ergonomic X-LOCK angle grinder that combines portability, performance and best user comfort. Its brushless motor provides equivalent 8.0 amps of power and greater efficiency that maximizes runtime and productivity. It features the X-LOCK mount, offering a wheel change interface that's up to five times faster than conventional interfaces. There’s an audible snap when mounting an X-LOCK wheel on an X-LOCK grinder. The wheel mounts properly without the need for a spanner wrench or flange nuts. The wheel is released from the grinder with the pull of a lever. This 4-1/2 In. 18V grinder has restart protection to help prevent accidental start-up when switching batteries, soft-start technology to reduce startup torque and ease into cuts, and overload protection to reduce the risk of the motor overloading or overheating It is designed with spiral bevel gears that provide smooth transmission of power to grinding applications. It also features an adjustable tool-free guard and an updated gearhead mounting collar, which is now compatible with all Bosch metal and concrete cutting guards. This tool features a two-position side handle and a slim soft-grip design.","price":"8999"}]